Задача: Написать программу, которая из имеющегося массива строк формирует массив из строк,
длина которых меньше или равна 3 символа. Первоначальный массив можне ввести с клавиатуры,
либо задать на старте выполнения алгоритма.

Решение: Результат выполнения программы - массив строк, неопределенной длины, меньшей или равной длине первоначального массива, содержащий строки согласно условию( длина <=3). Для формирования такого массива можно использовать метод Array.Resize. 
1. Создаем функцию string[] (string[]), котороая будет работать с массивом строк
2. В функции создаем новый массив строк string[] result, с длиной = 0, куда будут записываться значения.
3. Используем цикл for, для для работы по индексу с каждой строкой из первоначального массива строк, 
путем увеличения индекса i.
4. В цикле for создаем  строку string correct, которой присваиваем значение строки по индексу первоначального массива. Также создаем число j, значение которого равно длине string[] result.
5. Далее используем конструкцию if, для отбора строки согласно условия (если длина строки <= 3), при выполнении условия, увеличиваем длину string[] result с помощью метода Array.Resize на 1, и присваиваем ему по индексу j значение строки в него значение строки по индексу i из первоначального массива. (Таким образом, получаем массив, размер которого изначально неизвестен) Если условие не выполнено, действий не происходит.
6. Возвращаем результат string[] result, в цикл for.
7. Функция готова.
8. Задаем первоначальный массив строк.
9. Запускаем функцию с выводом результата с помощью  Console.WriteLine("String.Join(" ", );